In [1]:
import pandas as pd
import seaborn as sns
import nltk

In [2]:
data = pd.read_csv("spam.csv", encoding='latin1')
print(data.head(5))

     v1                                                 v2 Unnamed: 2  \
0   ham  Go until jurong point, crazy.. Available only ...        NaN
1   ham                      Ok lar... Joking wif u oni...        NaN
2  spam  Free entry in 2 a wkly comp to win FA Cup fina...        NaN
3   ham  U dun say so early hor... U c already then say...        NaN
4   ham  Nah I don't think he goes to usf, he lives aro...        NaN

  Unnamed: 3 Unnamed: 4
0        NaN        NaN
1        NaN        NaN
2        NaN        NaN
3        NaN        NaN
4        NaN        NaN

In [3]:
data = pd.read_csv("spam.csv", encoding='latin1')
print(data.head(5))

     v1                                                 v2 Unnamed: 2  \
0   ham  Go until jurong point, crazy.. Available only ...        NaN
1   ham                      Ok lar... Joking wif u oni...        NaN
2  spam  Free entry in 2 a wkly comp to win FA Cup fina...        NaN
3   ham  U dun say so early hor... U c already then say...        NaN
4   ham  Nah I don't think he goes to usf, he lives aro...        NaN

  Unnamed: 3 Unnamed: 4
0        NaN        NaN
1        NaN        NaN
2        NaN        NaN
3        NaN        NaN
4        NaN        NaN

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [5]:
data.describe()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
count,5572,5572,50,12,6
unique,2,5169,43,10,5
top,ham,"Sorry, I'll call later","bt not his girlfrnd... G o o d n i g h t . . .@""","MK17 92H. 450Ppw 16""","GNT:-)"""
freq,4825,30,3,2,2

In [6]:
data = data.drop(['Unnamed: 2','Unnamed: 3', 'Unnamed: 4'], axis=1)

In [7]:
data.head()

     v1                                                 v2
0   ham  Go until jurong point, crazy.. Available only ...
1   ham                      Ok lar... Joking wif u oni...
2  spam  Free entry in 2 a wkly comp to win FA Cup fina...
3   ham  U dun say so early hor... U c already then say...
4   ham  Nah I don't think he goes to usf, he lives aro...

In [8]:
missing_values = data.isnull().sum()

print(missing_values)

v1    0
v2    0
dtype: int64

In [9]:
duplicates = data.duplicated()
print("Total duplicate rows:", duplicates.sum())

Total duplicate rows: 403

In [10]:
duplicate_rows = data[data.duplicated()]
print(duplicate_rows)

        v1                                                 v2
102    ham  As per your request 'Melle Melle (Oru Minnamin...
153    ham  As per your request 'Melle Melle (Oru Minnamin...
206    ham  As I entered my cabin my PA said, '' Happy B'd...
222    ham                             Sorry, I'll call later
325    ham                   No calls..messages..missed calls
...    ...                                                ...
5524  spam  You are awarded a SiPix Digital Camera! call 0...
5535   ham  I know you are thinkin malaria. But relax, chi...
5539   ham                         Just sleeping..and surfing
5553   ham                        Hahaha..use your brain dear
5558   ham                             Sorry, I'll call later

[403 rows x 2 columns]

In [11]:
data=data.drop_duplicates()

In [12]:
data.describe()

          v1                          v2
count   5169                        5169
unique     2                        5169
top      ham  Rofl. Its true to its name
freq    4516                           1

In [13]:
data.shape[0]

5169

In [14]:
data.columns = ['label','email_text']

In [15]:
data.describe()

       label                  email_text
count   5169                        5169
unique     2                        5169
top      ham  Rofl. Its true to its name
freq    4516                           1

In [16]:
data['text_length'] = data ['email_text'].apply(len)

In [17]:
data['text_length'] = data['email_text'].apply(len)

Q1 = data['text_length'].quantile(0.25)
Q3 = data['text_length'].quantile(0.75)
IQR = Q3 - Q1
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

data_capped = data.copy()
data_capped['text_length'] = data_capped['text_length'].apply(
    lambda x: lower_bound if x < lower_bound else (upper_bound if x > upper_bound else x)
)

In [18]:
import pandas as pd
import nltk
import sklearn
print(pd.__version__, nltk.__version__, sklearn.__version__)

2.2.3 3.9.1 1.6.1

In [19]:
import pandas as pd
import nltk
import sklearn
print(pd.__version__, nltk.__version__, sklearn.__version__)

2.2.3 3.9.1 1.6.1

In [ ]:
dir D:\nltk_data

SyntaxError: invalid syntax (2615898411.py, line 1)